---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationConfigurationCorrupted
source: html/8380505d-1508-3a07-a713-acf81d5e4acd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationConfigurationCorrupted Property

It looks that the Fabrication Configuration %1!s! was corrupted, please check it at %2!s!.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationConfigurationCorrupted { get; }
```